<a href="https://colab.research.google.com/github/MarkHallett/-CoLab/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Mark Hallett Pandas cheat sheet

In [0]:
!pip install mh

Collecting mh
  Downloading https://files.pythonhosted.org/packages/c5/6d/b829395d240613f7167e779bc7f156cb4820f7b59f57c1d0593afb98a57a/mh-0.0.8-py3-none-any.whl
Installing collected packages: mh
Successfully installed mh-0.0.8

In [0]:
import mh

## 1 General

dtypes, head, tail, index, describe, columns, shape, T, info, count

In [0]:
import pandas as pd
import numpy as np

In [0]:
d = ({'A':1,'B':'b','C':2.2})
df = pd.DataFrame(d,[0])
df.dtypes

A      int64
B     object
C    float64
dtype: object

In [0]:
df.head(5)

   A  B    C
0  1  b  2.2

In [0]:
df.index

Int64Index([0], dtype='int64')

In [0]:
df.describe()

         A    C
count  1.0  1.0
mean   1.0  2.2
std    NaN  NaN
min    1.0  2.2
25%    1.0  2.2
50%    1.0  2.2
75%    1.0  2.2
max    1.0  2.2

In [0]:
df.T

     0
A    1
B    b
C  2.2

In [0]:
df

   A  B    C
0  1  b  2.2

In [0]:
df.shape

(1, 3)

In [0]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1 entries, 0 to 0
Data columns (total 3 columns):
A    1 non-null int64
B    1 non-null object
C    1 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 112.0+ bytes

In [0]:
df.count()

A    3
B    3
C    3
dtype: int64

In [0]:
df.T

     0    1    2
A    1    2    3
B   22   33   44
C  333  444  555

In [0]:
pd1['c'].max()

'2'

In [0]:
# number of rows
len(pd1)

2

set index and column titles

In [0]:
pd1.index.name = 'INDEX'
pd1.columns.name = 'COLUMNS'
pd1

COLUMNS   0   1   2    3
INDEX
0         1   2   3  NaN
1         4   5   6  NaN
2         7   8   9    a
3        10  11  12    b

## 2 Create DataFrame

### Dictionary of columns ( variables)

In [0]:

import pandas as pd
data1 = { 'a':['b','c'] ,  'B':['A','B'] , 'c':['1','2'] , 'd':['1','2']   }

pd1 = pd.DataFrame(data1)
pd1

   B  a  c  d
0  A  b  1  1
1  B  c  2  2

Specify the order of columns

In [0]:
pd2 = pd.DataFrame(data1, columns=[ 'a','B','c','d','e'])
pd2

   a  B  c  d    e
0  b  A  1  1  NaN
1  c  B  2  2  NaN

### From a dict of dicts

In [0]:
datadd = { 'Nevada': { 2001:2.4, 2002:2.9},
           'Ohio': { 2000:1.5, 2001:2.4, 2002:2.9}}
pddd = pd.DataFrame(datadd)
pddd

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   2.4
2002     2.9   2.9

with specific index (rows)

In [0]:
pddd2 = pd.DataFrame(datadd, index=[2001,2002,2003])
pddd2

      Nevada  Ohio
2001     2.4   2.4
2002     2.9   2.9
2003     NaN   NaN

### Different formats of column data entry

In [0]:
df2 = pd.DataFrame(
              { 'A' : 1., # All one vlaue
                'B' : pd.Timestamp('20130102'),   # date                   
                'C ' :pd.Series(1,index=list(range(4)),dtype='float32'), # series
                'D' : np.array([3] * 4,dtype='int32'), # array
                'E' : pd.Categorical(["test","train","test","train"]),
                'F' : 'foo', 
                'G' : [1,2,3,4]  # list
              })
df2

     A          B   C   D      E    F  G
0  1.0 2013-01-02  1.0  3   test  foo  1
1  1.0 2013-01-02  1.0  3  train  foo  2
2  1.0 2013-01-02  1.0  3   test  foo  3
3  1.0 2013-01-02  1.0  3  train  foo  4

### date range random numbers

In [0]:
# eg dates and data
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [0]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.337425  0.419965  0.064828  0.065867
2013-01-02  0.715076  0.896451  0.093573  1.164690
2013-01-03  2.244118  1.075180 -0.458979 -0.642527
2013-01-04  1.139121  0.568490  0.136447  1.537521
2013-01-05  1.549626  0.549848 -0.936035 -0.419732
2013-01-06 -0.099543  0.731738 -0.648349  1.211823

###A dictionary per row (observation)

In [0]:
# row per dict
# list of dicts
data1 = [ { 'a': 1 ,'b':2}, { 'a': 2 ,'b':3}, { 'a': 4 ,'b':5},  ]

pd1 = pd.DataFrame(data1)
pd1

   a  b
0  1  2
1  2  3
2  4  5

### A list of rows (observations, tuples)

In [0]:
# row per tuple
# list of tuples

data1 = [ (1,2,3), (4,5,6), (7,8,9), (10,11,12) ]

pd1 = pd.DataFrame(data1)
pd1

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

### Zipped lists of rows (variables)

In [0]:
# zipped list of tupples
names = ['Bob','Jessica','Mary','John','Mel']
births = [968, 155, 77, 578, 973]
data = list(zip(names,births))
df = pd.DataFrame(data)
df

         0    1
0      Bob  968
1  Jessica  155
2     Mary   77
3     John  578
4      Mel  973

In [0]:
# creation with index
df= pd.DataFrame({"a" : [4 ,5, 6], 
                  "b" : [7, 8, 9], 
                  "c" : [10, 11, 12]}, 
                  index = [1, 2, 3])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

### Filled with numbers

In [0]:
df = pd.DataFrame( np.arange(16).reshape((4,4)), index=['A','B','C','D'], columns=['a','b','c','d'])
df

    a   b   c   d
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15

## 3 Add to DataFrame

In [0]:
df = pd.DataFrame({ 'a':[1,2], 'b':[1,2], 'c':[1,2],  })

df['D'] = [10,11]
df

   a  b  c   D
0  1  1  1  10
1  2  2  2  11

Add a whole column

In [0]:
data1 = [ (1,2,3), (4,5,6), (7,8,9), (10,11,12) ]

pd1 = pd.DataFrame(data1)
pd1

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [0]:
pd1[3] = pd.Series([ 'a','b'], index=(2,3))
pd1

    0   1   2    3
0   1   2   3  NaN
1   4   5   6  NaN
2   7   8   9    a
3  10  11  12    b

In [0]:
df['E'] = 101
df

                   A         B         C         D    E
2013-01-01  1.163517  0.332166 -0.371921  1.163013  101
2013-01-02 -0.310275  0.566199  0.485881  0.435333  101
2013-01-03 -1.200061  0.996003 -0.696182 -0.662919  101
2013-01-04  1.559395 -1.374973  0.246549 -0.211251  101
2013-01-05  0.319102  1.055651 -0.654020  1.528974  101
2013-01-06 -1.686310 -1.730126 -0.815236  0.523865  101

Add a range

In [0]:
df['F'] = range(1,7)
df

                   A         B         C         D    E  F
2013-01-01  1.163517  0.332166 -0.371921  1.163013  101  1
2013-01-02 -0.310275  0.566199  0.485881  0.435333  101  2
2013-01-03 -1.200061  0.996003 -0.696182 -0.662919  101  3
2013-01-04  1.559395 -1.374973  0.246549 -0.211251  101  4
2013-01-05  0.319102  1.055651 -0.654020  1.528974  101  5
2013-01-06 -1.686310 -1.730126 -0.815236  0.523865  101  6

At specific places

In [0]:
df1

NameError: ignored

In [0]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [0]:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01 -0.337425  0.419965  0.064828  0.065867  NaN
2013-01-02  0.715076  0.896451  0.093573  1.164690  1.0
2013-01-03  2.244118  1.075180 -0.458979 -0.642527  2.0
2013-01-04  1.139121  0.568490  0.136447  1.537521  3.0
2013-01-05  1.549626  0.549848 -0.936035 -0.419732  4.0
2013-01-06 -0.099543  0.731738 -0.648349  1.211823  5.0

## 4 Update data

In [0]:
# by value
df.at[dates[0],'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.419965  0.064828  0.065867  NaN
2013-01-02  0.715076  0.896451  0.093573  1.164690  1.0
2013-01-03  2.244118  1.075180 -0.458979 -0.642527  2.0
2013-01-04  1.139121  0.568490  0.136447  1.537521  3.0
2013-01-05  1.549626  0.549848 -0.936035 -0.419732  4.0
2013-01-06 -0.099543  0.731738 -0.648349  1.211823  5.0

In [0]:
df.iat[0,1] = 0.1
df

                   A         B         C         D    F
2013-01-01  0.000000  0.100000  0.064828  0.065867  NaN
2013-01-02  0.715076  0.896451  0.093573  1.164690  1.0
2013-01-03  2.244118  1.075180 -0.458979 -0.642527  2.0
2013-01-04  1.139121  0.568490  0.136447  1.537521  3.0
2013-01-05  1.549626  0.549848 -0.936035 -0.419732  4.0
2013-01-06 -0.099543  0.731738 -0.648349  1.211823  5.0

In [0]:
# whole column, update with numpy array
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.100000  0.064828  5  NaN
2013-01-02  0.715076  0.896451  0.093573  5  1.0
2013-01-03  2.244118  1.075180 -0.458979  5  2.0
2013-01-04  1.139121  0.568490  0.136447  5  3.0
2013-01-05  1.549626  0.549848 -0.936035  5  4.0
2013-01-06 -0.099543  0.731738 -0.648349  5  5.0

In [0]:
# where on whole df
df2 = df.copy()
df2[df2 < 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.100000  0.064828  5  NaN
2013-01-02  0.715076  0.896451  0.093573  5  1.0
2013-01-03  2.244118  1.075180  0.458979  5  2.0
2013-01-04  1.139121  0.568490  0.136447  5  3.0
2013-01-05  1.549626  0.549848  0.936035  5  4.0
2013-01-06  0.099543  0.731738  0.648349  5  5.0

## 5 Modify DataFrame

In [0]:
#sort by axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.125366 -0.250743 -0.727355 -0.614316
2013-01-02  1.273794 -0.449667 -0.488096  0.330320
2013-01-03 -0.144976  0.277706  0.079873 -1.173828
2013-01-04 -1.203602  0.383898  1.510191 -0.220848
2013-01-05 -0.308972 -0.126518 -1.127420  0.657156
2013-01-06  0.104411  1.232420 -0.625490 -1.850150

In [0]:
# sort by data
df.sort_values(by='B')

                   A         B         C         D
2013-01-05  0.657156 -1.127420 -0.126518 -0.308972
2013-01-01 -0.614316 -0.727355 -0.250743 -1.125366
2013-01-06 -1.850150 -0.625490  1.232420  0.104411
2013-01-02  0.330320 -0.488096 -0.449667  1.273794
2013-01-03 -1.173828  0.079873  0.277706 -0.144976
2013-01-04 -0.220848  1.510191  0.383898 -1.203602

## 6 Delete from DataFrame

In [0]:
df = pd.DataFrame( { 'A':(1,2,3), 'B':(22,33,44), 'C':(333,444,555) })
df

   A   B    C
0  1  22  333
1  2  33  444
2  3  44  555

In [0]:
# drop returns a new df with modified data, or can do an inplace drop
df.drop(['A'], axis=1 )

    B    C
0  22  333
1  33  444
2  44  555

In [0]:
del df['B'] # del does an inplace drop
df

   A    C
0  1  333
1  2  444
2  3  555

In [0]:
df

   A    C
0  1  333
1  2  444
2  3  555

In [0]:
df.drop('C',axis='columns', inplace=True)
df

   A
0  1
1  2
2  3

### dropna

In [0]:
# can also do inplace
df.dropna()   # drops any row with a null value
df.dropna(thresh=4)  # drop any row with more than 4 ( threshhold) null values
df.dropna(axis=1)   # drops any column with a null value

In [0]:
# how
df.dropna(how='all') # any value is NaN
df.dropna(how='any') # all values are NaN

   A
0  1
1  2
2  3

### Remove duplicates

In [0]:
dfd = pd.DataFrame(
              { 'A' : 1., # All one vlaue
                'B' : pd.Timestamp('20130102'),   # date                   
                'C ' :pd.Series(1,index=list(range(4)),dtype='float32'), # series
                'D' : np.array([3] * 4,dtype='int32'), # array
                'E' : pd.Categorical(["test","train","test","train"]),
                'F' : 'foo', 
                'G' : [1,2,3,2]  # list
              })
dfd

     A          B   C   D      E    F  G
0  1.0 2013-01-02  1.0  3   test  foo  1
1  1.0 2013-01-02  1.0  3  train  foo  2
2  1.0 2013-01-02  1.0  3   test  foo  3
3  1.0 2013-01-02  1.0  3  train  foo  2

In [0]:
# to find out if there are duplicated rows
print (dfd.duplicated())
print (dfd.duplicated().any() )

0    False
1    False
2    False
3     True
dtype: bool
True

In [0]:
# to see the duplicated rows
dfd[dfd.duplicated()]

     A          B   C   D      E    F  G
3  1.0 2013-01-02  1.0  3  train  foo  2

In [0]:
# remove duplicates
dfd.drop_duplicates(inplace=True)
dfd

     A          B   C   D      E    F  G
0  1.0 2013-01-02  1.0  3   test  foo  1
1  1.0 2013-01-02  1.0  3  train  foo  2
2  1.0 2013-01-02  1.0  3   test  foo  3

In [0]:
# can be used to find unique values in a column
dfd['E'].drop_duplicates()

0     test
1    train
Name: E, dtype: category
Categories (2, object): [test, train]

## 7 Reshape DataFrame

In [0]:
df = pd.DataFrame( np.arange(16).reshape((4,4)), index=['A','B','C','D'], columns=['a','b','c','d'])
df

    a   b   c   d
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15

### Converting types

In [0]:
df.dtypes

a    int64
b    int64
c    int64
d    int64
dtype: object

In [0]:
dn =df['a'].astype(float)
dn

A     0.0
B     4.0
C     8.0
D    12.0
Name: a, dtype: float64

In [0]:
dn = df.astype({'a': str, 'b':float}) # the only 2 types that are able to be null
dn

    a     b   c   d
A   0   1.0   2   3
B   4   5.0   6   7
C   8   9.0  10  11
D  12  13.0  14  15

### (Re)setting the index

In [0]:
dn = df.reset_index()
dn

  index   a   b   c   d
0     A   0   1   2   3
1     B   4   5   6   7
2     C   8   9  10  11
3     D  12  13  14  15

In [0]:
dn = df.reset_index(drop=True)  #, inplace=True)
dn

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [0]:
dn = df.set_index('d')
dn

     a   b   c
d
3    0   1   2
7    4   5   6
11   8   9  10
15  12  13  14

### Rename columns and rows

In [0]:
dn = df.rename(columns={'a':'Apple','b':'Bananas'})
dn.rename(index={'C':'Cat'}, inplace=True)
dn

     Apple  Bananas   c   d
A        0        1   2   3
B        4        5   6   7
Cat      8        9  10  11
D       12       13  14  15

In [0]:
df

    a   b   c   d
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15

## 8 Select (filter and sort) from DataFrame

### Column selection

dictionary type select

In [0]:
df['A']

0    1
1    2
2    3
Name: A, dtype: int64

select by attribute

In [0]:
df.A

0    1
1    2
2    3
Name: A, dtype: int64

### Row selection

In [0]:
# by row number
df[0:3]

   A   B    C
0  1  22  333
1  2  33  444
2  3  44  555

select by index

In [0]:
# select by locationn, label (index number)
dates = pd.date_range('20130101', periods=6)
print (dates)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
print (df)

df.loc[dates[0]]

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')
                   A         B         C         D
2013-01-01  1.163517  0.332166 -0.371921  1.163013
2013-01-02 -0.310275  0.566199  0.485881  0.435333
2013-01-03 -1.200061  0.996003 -0.696182 -0.662919
2013-01-04  1.559395 -1.374973  0.246549 -0.211251
2013-01-05  0.319102  1.055651 -0.654020  1.528974
2013-01-06 -1.686310 -1.730126 -0.815236  0.523865

A    1.163517
B    0.332166
C   -0.371921
D    1.163013
Name: 2013-01-01 00:00:00, dtype: float64

In [0]:

df2 = pd.DataFrame(data1, index=['y','z'])
df2

   B  a  c  d
y  A  b  1  1
z  B  c  2  2

In [0]:
df2.loc['z']

B    B
a    c
c    2
d    2
Name: z, dtype: object

In [0]:
# select by location, index and columns
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.330320 -0.488096
2013-01-03 -1.173828  0.079873
2013-01-04 -0.220848  1.510191

In [0]:
# select by location number ( index, columns)
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.220848  1.510191
2013-01-05  0.657156 -1.127420

In [0]:
# select specific location by number
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.330320 -0.449667
2013-01-03 -1.173828  0.277706
2013-01-05  0.657156 -0.126518

In [0]:
# select a whole row 
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.330320 -0.488096 -0.449667  1.273794
2013-01-03 -1.173828  0.079873  0.277706 -0.144976

In [0]:
# select a whole column
df.iloc[:,:2:3]

                   A
2013-01-01 -0.614316
2013-01-02  0.330320
2013-01-03 -1.173828
2013-01-04 -0.220848
2013-01-05  0.657156
2013-01-06 -1.850150

In [0]:
# single value
 df.iloc[1,1]  # or faster df.iat[1,1]

-0.48809592032947724

In [0]:
# select where (select row where value ..)
df[df.A > 0]

                   A         B         C         D
2013-01-02  0.330320 -0.488096 -0.449667  1.273794
2013-01-05  0.657156 -1.127420 -0.126518 -0.308972

In [0]:
# select value where value ...
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02  0.330320       NaN       NaN  1.273794
2013-01-03       NaN  0.079873  0.277706       NaN
2013-01-04       NaN  1.510191  0.383898       NaN
2013-01-05  0.657156       NaN       NaN       NaN
2013-01-06       NaN       NaN  1.232420  0.104411

In [0]:
# select where row where value is in ...

df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']

df2[ df2['E'].isin(['one','four',]) ]

                   A         B         C         D     E
2013-01-01 -0.337425  0.419965  0.064828  0.065867   one
2013-01-02  0.715076  0.896451  0.093573  1.164690   one
2013-01-05  1.549626  0.549848 -0.936035 -0.419732  four

### Select by value

In [3]:
df = pd.DataFrame( np.arange(16).reshape((4,4)), index=['A','B','C','D'], columns=['a','b','c','d'])
df

    a   b   c   d
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15

In [14]:
x = df[ df.a.isin([4,8,9]) & (df.c == 10) ]
x

   a  b   c   d
C  8  9  10  11

### Select unique values and the count

In [0]:
df = pd.DataFrame({'A':[1,2,3,3,4,2,3,3,]})
df['A'].value_counts()

3    4
2    2
4    1
1    1
Name: A, dtype: int64

## 9 Group by ...

## 10 Missing data ...

Also see dropna in Delete from dataframe

In [0]:
np.NaN

nan

In [0]:
# dropna (how='any')
# fillna(value = 5)

### isnull

In [0]:
df.isnull()

       a      b      c      d
A  False  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False

In [0]:
df.isnull().any() # columns with missing data ( summary)

a    False
b    False
c    False
d    False
dtype: bool

In [0]:
df[df.isnull().any(axis=1)]  # rows with missing data ( all data)

Empty DataFrame
Columns: [a, b, c, d]
Index: []

In [0]:
df.notnull().all()  # notnull() and all

a    True
b    True
c    True
d    True
dtype: bool

### fillna

In [0]:
df = pd.DataFrame( np.arange(16).reshape((4,4)), index=['A','B','C','D'], columns=['a','b','c','d'])
df

    a   b   c   d
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15

In [0]:
df.fillna(10)

    a   b   c   d
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15

In [0]:
# fill with column mean
df.fillna(df.mean())

    a   b   c   d
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15

In [0]:
df.fillna(method='ffill')  # bfill

# also takes inplace and columns (names)

    a   b   c   d
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15

### interpolate ( TODO )

## 11 Adding, merging, joining, concat  DataFrames

Adding Series

In [0]:
a = pd.DataFrame( { 'A':[1] , 'B':[2], 'C':[3] } )
b = pd.DataFrame( { 'C':[3] , 'D':[4], 'E':[5] } )

In [0]:
# + only where there are matches, otherwise NaN for all other places
a+b

    A   B  C   D   E
0 NaN NaN  6 NaN NaN

In [0]:
a*b

    A   B  C   D   E
0 NaN NaN  9 NaN NaN

Adding dataframes

In [0]:
  # same for dataframe +* dataframe
  adf = pd.DataFrame({'A':[1,2,3], 'B': [1,2,3]})
  bdf = pd.DataFrame({'B':[1,2,3], 'C': [1,2,3]}, index=[1,2,3])
  adf * bdf

    A    B   C
0 NaN  NaN NaN
1 NaN  2.0 NaN
2 NaN  6.0 NaN
3 NaN  NaN NaN

Adding a series and a dataframe

In [0]:
#the series is applied to every row ?? TODO
s = pd.Series({'a':10,'b':11,'b':12})
df = pd.DataFrame( { 'a':[1,1,1], 'b':[1,1,1], 'c':[1,1,1] })
s+df

      a     b   c
0  11.0  13.0 NaN
1  11.0  13.0 NaN
2  11.0  13.0 NaN

Merging

In [0]:
pde= pd.DataFrame({'e1':[8,7,4,3],'e2':[4,5,4,4],'e3':[9,8,7,5]},index=['Ann','Bob','Cat','Dave'])
pde=pde
pde

      e1  e2  e3
Ann    8   4   9
Bob    7   5   8
Cat    4   4   7
Dave   3   4   5

In [0]:
pdr= pd.DataFrame({'r1':[8,7,4,2],'r2':[4,5,4,3],'r3':[9,8,7,1]},index=['Ann','Bob','Cat','Ed'])
pdr=pdr
pdr

     r1  r2  r3
Ann   8   4   9
Bob   7   5   8
Cat   4   4   7
Ed    2   3   1

In [0]:
# inner join
pd.merge(pde, pdr, left_index=True, right_index=True)

     r1  r2  r3  e1  e2  e3
Ann   8   4   9   8   4   9
Bob   7   5   8   7   5   8
Cat   4   4   7   4   4   7

In [0]:
#default left join
pde.join(pdr)

      e1  e2  e3   r1   r2   r3
Ann    8   4   9  8.0  4.0  9.0
Bob    7   5   8  7.0  5.0  8.0
Cat    4   4   7  4.0  4.0  7.0
Dave   3   4   5  NaN  NaN  NaN

In [0]:
#default outer join
pd.concat([pde, pdr], axis=1)

       e1   e2   e3   r1   r2   r3
Ann   8.0  4.0  9.0  8.0  4.0  9.0
Bob   7.0  5.0  8.0  7.0  5.0  8.0
Cat   4.0  4.0  7.0  4.0  4.0  7.0
Dave  3.0  4.0  5.0  NaN  NaN  NaN
Ed    NaN  NaN  NaN  2.0  3.0  1.0

In [0]:
df1 = pd.DataFrame({'a':range(6),'b':[5,3,6,9,2,4]}, index=list('abcdef'))
df1

   a  b
a  0  5
b  1  3
c  2  6
d  3  9
e  4  2
f  5  4

In [0]:
eg1 = pd.DataFrame( { 'A':[1] , 'B':[2], 'C':[3] }, [0] )
eg2 = pd.DataFrame( { 'A':[1] , 'B':['b'], 'D':['d'] }, [0] )
print (eg1)
print ()
print (eg2)
print ()
print (pd.merge(eg1, eg2,how='left') )  # on='x1'
print ()
print (pd.merge(eg1, eg2,how='right'))
print ()
print (pd.merge(eg1, eg2,how='inner') )
print ()
print (pd.merge(eg1, eg2,how='outer'))

   A  B  C
0  1  2  3

   A  B  D
0  1  b  d

   A  B  C    D
0  1  2  3  NaN

   A  B   C  D
0  1  b NaN  d

Empty DataFrame
Columns: [A, B, C, D]
Index: []

   A  B    C    D
0  1  2  3.0  NaN
1  1  b  NaN    d

## 12 Unclassified

Forward fill

In [0]:
eg_ff = pd.Series ( ['red', 'orange', 'green'], index=[0,2,4])
eg_ff

0       red
2    orange
4     green
dtype: object

In [0]:
# reindex creates a new df with a new index ( can also reindex columns )
eg_ff2 = eg_ff.reindex(range(6), method='ffill' )
eg_ff2

0       red
1       red
2    orange
3    orange
4     green
5     green
dtype: object

apply -- > modify data

melt